Timerszy/osc_panel/sdkconfig.defaults
# 目标芯片: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# 双核 FreeRTOS
CONFIG_FREERTOS_UNICORE=n

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# UART 驱动
CONFIG_UART_ISR_IN_IRAM=y

# SPI
CONFIG_SPI_MASTER_IN_IRAM=y

# 主频 240MHz
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# Flash 大小 (按实际模块选择, 常见 4MB / 8MB / 16MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# PSRAM (如使用 S3 with PSRAM 版本, 按需开启)
# CONFIG_ESP32S3_SPIRAM_SUPPORT=y
